Tekla Open API Reference for Tekla Structures 2025
Drawing.GetPlotFileNameExt Method
Get plot file name.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetPlotFileNameExt(
	IncludeRevisionMarkEnum includeRevisionInfo
)
Public Function GetPlotFileNameExt (
	includeRevisionInfo As IncludeRevisionMarkEnum
) As String
Parameters
includeRevisionInfo
Type: Tekla.Structures.Drawing.IncludeRevisionMarkEnum
How or if to include revision info.
Return Value
Type: String
The plot file name or an empty string if an error occured.
Remarks
 Note: The returned plot file name can contain invalid file name characters.
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace